# Uso de Dataframe en Pandas
## Daniel Alejandro Ulloa M치rquez
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [67]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
#from pandas.tools.plotting import radviz

%matplotlib inline

In [68]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23], 'c': [31,32,33]}))
print (mi_df)

    a   b   c
0  11  21  31
1  12  22  32
2  13  23  33

In [69]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1], 
        'cant칩n': ['Loja','','']}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

      ciudad    capital  zona cant칩n
0       Loja       Loja     7   Loja
1  Pichincha      Quito     8
2     Guayas  Guayaquil     1

In [70]:
columnas = ['nombres','apellidos','cedula','ciudad']

In [71]:
lista = [['rene', 'elizalde', '11041260','loja'],
        ['rolando', 'solano', '11041261','quito'],
        ['daniel','ulloa','123456798','cuenca']]

In [72]:
data = pd.DataFrame(lista, columns=columnas)

In [73]:
data

   nombres apellidos     cedula  ciudad
0     rene  elizalde   11041260    loja
1  rolando    solano   11041261   quito
2   daniel     ulloa  123456798  cuenca

In [74]:
lista2 = [['rene2', 'elizalde2', '11041263','catamayo'],
        ['rolando2', 'solano2', '11041264','atacames'],]

In [75]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [76]:
data2

    nombres  apellidos    cedula    ciudad
0     rene2  elizalde2  11041263  catamayo
1  rolando2    solano2  11041264  atacames

In [77]:
data3 = pd.concat([data, data2])

In [78]:
data3

    nombres  apellidos     cedula    ciudad
0      rene   elizalde   11041260      loja
1   rolando     solano   11041261     quito
2    daniel      ulloa  123456798    cuenca
0     rene2  elizalde2   11041263  catamayo
1  rolando2    solano2   11041264  atacames

In [79]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [80]:
data5

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha
3  11041266       Loja       Loja

In [81]:
result = pd.merge(data3, data5, on='cedula')

In [82]:
result

   nombres  apellidos    cedula    ciudad     Ciudad  Provincia
0     rene   elizalde  11041260      loja  Guayaquil     Guayas
1  rolando     solano  11041261     quito     Cuenca      Azuay
2    rene2  elizalde2  11041263  catamayo      Quito  Pichincha

In [83]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha

In [84]:
list2 = [['Marco', 'Brice침o', '123123','loja'],
        ['Alexis', 'Montoya', '456456','quito'],
        ['Luis','Uday','789789','cuenca']]

In [85]:
datos2 = pd.DataFrame(list2, columns=columnas)

In [86]:
datos2

  nombres apellidos  cedula  ciudad
0   Marco   Brice침o  123123    loja
1  Alexis   Montoya  456456   quito
2    Luis      Uday  789789  cuenca

In [87]:
datos5 = pd.DataFrame({'cedula': ['123123', '456456', '789789'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})

In [88]:
datos5

   cedula     Ciudad  Provincia
0  123123  Guayaquil     Guayas
1  456456     Cuenca      Azuay
2  789789      Quito  Pichincha

In [89]:
result = pd.merge(datos2, datos5, on='cedula')
result

  nombres apellidos  cedula  ciudad     Ciudad  Provincia
0   Marco   Brice침o  123123    loja  Guayaquil     Guayas
1  Alexis   Montoya  456456   quito     Cuenca      Azuay
2    Luis      Uday  789789  cuenca      Quito  Pichincha